---
kind: method
id: M:Autodesk.Revit.DB.DirectContext3D.EffectInstance.SetAmbientColor(Autodesk.Revit.DB.Color)
source: html/8b664a39-8174-b5c3-f4b7-67f71ffaaf6b.htm
---
# Autodesk.Revit.DB.DirectContext3D.EffectInstance.SetAmbientColor Method

Sets the ambient color parameter of the effect instance.

## Syntax (C#)
```csharp
public void SetAmbientColor(
	Color color
)
```

## Parameters
- **color** (`Autodesk.Revit.DB.Color`) - The ambient color value.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null